class About:
    me = '<h2>关于我自己，说点什么好呢</h2><p>我先想想从这些方面说一下</p><h3>1、我的性格</h3><a id=\'one\'></a><p>这个好像没什么好说的，但是本来这个网站就是用来做这个的想到什么就写点什么呗。但是性格这种东西总不能自己说吧，就说说别人对我的评价呗。</p><p>我的现同事1：“福建人说话就是这么温柔呢，”来自一个被欺骗了两个星期一直以为我是福建人的同事。</p><p>我前同事A和B的对话：A：“小梁他好温柔哦”B：“是的呢，他一直都是这么温柔的”一个华为网友和我旁边的外包同事开会时的闲聊。</p><p>来自我女朋友的母亲：“啊小梁是不是很犟啊”女友和我吵架后，一言不和就出门的我被女友妈妈如此评价。</p><p>来自我的妈妈：“你就跟你爸一样！”，在我和我妈吵架以后妈妈对我的评价。但是吧，我觉得我爸的性格挺好的，所以这应该是我收到过最好的评价。</p><h3>2、聊到这里，突然想聊聊我的日常</h3><a id=\'two\'></a><p>日常这东西，虽然我经常换喜欢做的事情，但是好像还真有那么几个没变过的。比如现在生活里，学学习、游游泳、刷刷抖音和坐在马桶上发呆这些好像每天都没断过。曾经的我，也试过每天打DOTA到凌晨，每天练魔术练到手抽筋，躺在床上打手机麻将，拼高达拼乐高给手办凹不同的造型。现在这么想起来，好像也就是昨天。想想时间真的过得好快，唔。。是不是有点偏题了，聊下一项。</p><h3>3、既然都都聊到了，就说说我的爱好</h3><a id=\'three\'></a><p>小男生我想，应该没几个不喜欢打游戏的吧。最近上了2077有点想玩。但是好像又没时间（2020，12，16），下周五dota也要更新了，这么一想看看我的max+我的上一把游戏已经是两个月之前了，刚才打字的时候我还以为是4，5个月呢。</p><p>其他的爱好吧好像也很多，做饭烧菜，毕竟也是在顺德的大饭店后厨呆了好几个月的人了。做菜好吃，有人喜欢吃自然就会去做了。让喜欢的人快乐的时候其实自己也很快乐（甚至有点超越了让自己不喜欢的人不快乐的快乐）</p><p>魔术吧，这东西虽然好久没练了，但是毕竟是有证的人，给人变魔术也是件快乐的事情呢。</p><p>再想想，自己练得时候好像也是挺快乐的。运动男孩的快乐可能也是羽毛球，游泳，健身（哈哈哈哈哈哈哈，没想到自己把撸铁也算上了，但是好像也挺快乐的），篮球是不能打了膝盖伤了。不过篮球好像也没那么喜欢吧现在想想。</p><h3>4、最后聊聊学习？</h3><a id=\'four\'></a><p>本以为，学习是我不想讲的，毕竟枯燥又无聊哈哈哈哈哈哈。但是写着写着好像也没那么不想聊，学习变成一种习惯以后，就是会有种种菜的快乐？就是辛辛苦苦一段时间，到收获的时候，还是会有那么点成就感。主动的学自己喜欢的东西还是很快乐的嘛。最近在学前端，看着那些炫酷的页面，觉得前端也是很酷的嘛，哪有大家说的那么不堪。前端三件套，从以前的能硬写一些很丑的页面到现在渐入佳境，当然渐入佳境的还有我vue的学习，不过进度好像有点慢。再这么学下去感觉学完就要开始学3了呢。往后的计划是把我的数学复习一下，人工智能机器学习啥的，肝一波大的，然后大概是（政治？英语？）准备一下考研。如果中间还有时间，把swift再学一下，就写过一个丑丑的没啥用的app，仿写两三个大厂的软件，唔，还是先不要立这种flag，还是能随便写写app就好了。</p><h3>5、还想聊聊朋友</h3><a id=\'five\'></a><p>这么想想，我的朋友好像都有个共同点，那就是不爱工作，哈哈哈哈哈哈哈，可能不爱岗，不敬业才是我的交友条件吧。最近的朋友有小潘，小吴，小杨，小李，完了是不是出卖了我的朋友，不过吧虽然他们不怎么敬业乐业的，但是活还是好好干的。过年前要早点回广州，看看我的老朋友们，跟他们打打球，游游泳，吃个饭。这么一想，我还有山东的朋友，也不知道什么时候能见到。</p><p style="text-indent: 0em;">就这样吧也算是个平平无奇的自我介绍，有什么后续再写别的呗</p>'
    page = ' <a id=\'one\'></a><h2>关于这个网页</h2><h3>那就需要显说说先讲讲这个网页的原型</h3><p>在第一家公司，做测试的时候，就我一个会写代码，刚好换了个研发总监，说不行要搞个自动化不能这么硬测啊。然后再看看我们的产品，录像机，摄像头，那个UI就是00年代的dvd机界面，然后接个硬盘存这些东西怎么做自动化呀。后来和几个实习生一商量，先做个前后端，搞个页面糊弄过去再慢慢想。就用python的Django写了个后端，把他们调的接口做了个配置的脚本，写了个html，给两个按键点点，就调我Django的接口用python再调设备的接口。然根据自动化设置好的东西看UI有没有问题。其实啥效率都提升不了，领导看到就觉得还挺好，就是有点丑。那怎么办吧，学学css呗。就打开了菜鸟发现了一个实例，一看哇真棒能直接搬，于是就有了这么一个原型。<br>下面是地址：</p><a href="https://www.runoob.com/w3cnote/htmlcss-make-a-website.html" target="_blank">https://www.runoob.com/w3cnote/htmlcss-make-a-website.html</a><br><br><p>这个网页真是根据我的跳槽开始一点点变，到了第二家公司，因为是华为push项目纯后端的测试，Django的后端变得更复杂了，不仅仅是做测试了，就还给同事开发工具，一系列的根据测试需要开发的加解密工具，编码解码工具，调整字符串，申请token的接口，处理返回的数据，查他们数据库，各个集群环境监测自动重启的脚本，捞日志报错的功能，多线程的压测，来了一大波功能的升级。然后后端都升级了，前端总不能丢人把，还用html js css原生去硬写，不太说的过去。就学了下jQuery开始算是接触前端的开发了。把整个前端的代码重新写了一遍，算是熟悉了jQuery。</p><br><br><p>后来再跳槽到了华泰，跟几个前端开发玩的挺熟的，也是在华泰做测试没啥成就感了，想想转个开发把，就开始学前端。我的那个测试工具集成的网页又从jQuery变成了vue的。不得不说尤老师的东西还是很先进的，学习的时候学的那叫一个起劲。再后来觉得挺好用的，就把这个平台的前端做了一次大改然后搬出来我自己的博客用，最后风格就变成现在这样了。</p><br><br><h3>说说这个博客记录点啥</h3><a id=\'two\'></a><p>我一起开始是想把它弄成个找工作用的，炫技的东西。但是后来想想，也没必要，就随心做做成什么样就什么样，留一个角落给找工作用就好了。现在把，我就想用它来写写自己的日志，心情。记录一下学习踩得坑，解决问题记录一下过程，别下次又忘了。还有啥，之前力扣刷的题，刷过就忘，也在这里记录一下呗。然后等我后面还打算把学习打卡，评论都做好了，就在上面跟朋友吹吹牛逼也算是快乐。</p><br><br><h3>关于以后</h3><a id=\'three\'></a><p>我想把我的学习过程，学习方法，学习的一切都放上来，做做视频也也放上来，存存照片啥的，都挺好。也不知道那时候是什么时候了，不过时间这东西，就是很奇怪的，有时候一眨眼就过去了，都做好了，有时候就怎么都过不去呢。</p>'
    work = ' <h2>关于工作</h2><a id=\'one\'></a><h3>工作经历</h3><br><h4>中软国际</h4><p>测试工程师 2020.09-至今 <br> <br>工作内容：<br> 集成一键生成客户、回归用例环境预置、用户信息查询、网站导航的测试平台开发 <br>app测试<br></p><h4>软通动力</h4><p>测试工程师 2020.03-2020.08<br><br>工作内容：<br> Tomcat 部件、nuwa 部件的环境部署 Zookeeper 部署，证书安装，<br>测试方案、用例编写<br>独立搭建Django+request+jQuery+mysql的接口自动化、测试工具、<br>文档集成的测试平台组织部门培训，输出培训文档总结和培训记录</p><h4>广州长视电子有限公司</h4><p>测试工程师 2017.08-2020.02 <br><br>工作内容：<br> 安防设备：摄像头、录像机等嵌入式设备的测试<br>web测试<br>selenium web页面自动化测试<br>requests接口自动化测试<br>Django+Python+html+js的自动化可视化的平台搭建</p><br><br><a id=\'two\'></a><h3>项目经历</h3><br><h4>软通动力 2020.03-2020.08</h4><p>版本测试：<br><br>华为 push 的业务，主要负责环境搭建和接口功能测试。版本升级，通过 jenkins 持续集成<br>升级部署业务到机器。启动部件，进行接口测试。<br>根据华为测试平台提供的方法编写每个版本的接口<br>自动化测试用例。 <br><br>专项工作：<br><br>输出 python 测试工具，通过了解测试需求及对外支撑需求，<br>将平时常用文件、常用加解密方法、常用接口、返回码查询、<br>日常工作提醒、MySQL 查询能力集成到通过 django+requests+mysql+jQuery+html<br>的 pushTest 平台。<br>学习 java 模拟桩代码对基础代码提供新功能升级能力。负责组织部门<br>内部培训分享、能力传递，部门要求每周一到两次部门内部培训，<br>通过了解测试不同部件的同事常用技术、文件、功能内部配置、<br>接口 body 体键值对作用、配置文件对应内容，督促同事提供内部培训、分享及能力传递。</p><br><h4>广州长视电子科技公司 2019.11-2020.02</h4><br><p>主要负责基于 Lunix 的嵌入式设备 UI 从静态页面升级为动态页面的<br>UI 测试及新增手势解锁等新功能的逻辑测试。</p><br><h4>广州长视电子科技公司 2018.10-2019.10</h4><br><p>基于 XVR 的功能接口、生效情况的 requests 接口自动化测试平台搭建。<br>负责 python 后端的 requests 请求修改 XVR 配置的接口逻辑代码编写，<br>和 selenium 检测前端视频预览截图，使用PIL获取图片色值，检查生效情况，<br>paramiko 操作查询后端设备数据库的值及打印抓取查<br>看生效情况返回用例结果<br></p><br><h4>广州长视电子科技公司 2017.08-2018.09</h4><br><p>项目里主要负责基于 Lunix 的嵌入式设备录像时的系统稳定和<br>编码效果进行测试。系统稳定：根据设备硬件规格和程序设计需求，<br>对设备进行调整接入录像的码流控制，逐步控制系统压力，<br>测试系统的稳定性，确认系统压力瓶颈。通过观测视频质量、<br>系统打印代码和脚本查看录像编解码状态，确认 264+，265+功能正常。</p><br><a id=\'three\'></a><h3>工作技能</h3><h4>python：</h4> <p>后端开发（其实就是自己封接口，写逻辑，对于django本身的东西用的很少2020，12，16），自动化测试（pytest），接口自动化开发（requests），页面自动化开发（selenium），数据库（pymysql），自动化运维（paramiko）</p> <h4>swift：</h4><p>那就是cocoa导入包，面向复制粘贴开发，调个接口，显示个数据，拖一下控件，写写逻辑，勉勉强强弄个能自己玩玩的app吧</p><h4>web：</h4><p>html+css+js ，vue大礼包，ES6(不够熟)，webpack（不够熟）</p>'
    skill = '<h2>关于技能</h2><a id=\'one\'></a><p>哈哈哈哈哈哈，这个东西就有意思了，会的东西太多了，让我想想怎么写。那就从最喜欢的开始写，一丢丢慢慢来</p><h3>那首先就是给我喜欢玩的游戏一个面子了</h3><p>dota2:米波，电狗,维萨吉，绝活海玩家。</p><p>英雄联盟郊区王者，战术发明家，以前那些啥奇怪的打发都是我大学的时候玩剩的，后来不玩就不爱了，但是牛逼还是要吹一下。突然就想不起来了，可能我也不是一个特别喜欢玩游戏的人吧</p><a id=\'two\'></a><h3>然后写写运动类的</h3><p>羽毛球那大概是俱乐部中上游水平。然后到游泳大概就是四种泳姿都会，转身蹬边啥的，反正就是游的很快。溜冰，滑雪这两种就是特别喜欢，但是贼菜，就是能在冰上流畅的滑行，转弯。双板能在雪上滑，然后滑个初级道转转弯也没啥问题吧。我真是又菜瘾又大</p><a id=\'three\'></a><h3>然后就到我的厨艺了吧</h3><p>你非要我描述一下，那大概就是很好吃，写到这里我决定要在我的博客里加一个写做菜的专栏，毕竟在顺德有名的酒店里掌过勺的。虽然只是负责备菜和做菜给同事吃，但是水平也有在大厨们的调教下稳步上升</p><a id=\'four\'></a><h3>忘了说，其实我还是个魔术师</h3><p>初中开始学魔术，到大学，到两年前最后一次表演，演艺生涯勉强算算也有十年吧。这东西怎么说呢，让我现在接表演吧，可能需要一段时间的复健。现在水平肯定大不如前了。魔术这东西就是费钱费神费手费脑，如果不是真爱，这的搞不了那么久</p><a id=\'five\'></a><h3>最后说说写这个网页时候的技能吧</h3><p style="text-indent: 0em;">python：</p><p>后端开发（其实就是自己封接口，写逻辑，对于django本身的东西用的很少2020，12，16），自动化测试（pytest），接口自动化开发（requests），页面自动化开发（selenium），数据库（pymysql），自动化运维（paramiko）</p><p style="text-indent: 0em;">swift：</p><p>那就是cocoa导入包，面向复制粘贴开发，调个接口，显示个数据，拖一下控件，写写逻辑，勉勉强强弄个能自己玩玩的app吧</p><p style="text-indent: 0em;"> web：</p><p>html+css+js ，vue大礼包，ES6，webpack</p>'

    def __init__(self, me=me, page=page, work=work, skill=skill):
        self.me = me
        self.page = page
        self.work = work
        self.skill = skill

    def aboutMe(self):
        menuList = ['--关于我自己', '--我的性格', '--我的日常', '--我的爱好', '--我的学习', '--我的朋友']
        heightList = [0, 112, 535, 741, 1240, 1650, 99999]
        iMsg = '关于我自己'
        iMsg2 = '通过多个角度，认识一下自己，只是单纯的发发牢骚'
        imsgt = '2021-01-07'
        munNum = [1, 2, 3, 4, 5]

        return {'menuList': menuList, 'heightList': heightList, 'iMsg': iMsg, 'iMsg2': iMsg2, 'imsgt': imsgt, 'munNum': munNum}


    def aboutPage(self):
        menuList = ['--关于这个网页', '--网页的原型', '--博客写什么', '--关于以后']
        iMsg = '关于这个网页'
        iMsg2 = '还想弄个相册记录一下这个网页是怎么从贼丑，一点点变成现在这样的'
        imsgt = '2021-01-07'
        heightList = [0, 25, 1250, 1400, 9999999]
        munNum = [1, 2, 3]

        return {'menuList': menuList, 'heightList': heightList, 'iMsg': iMsg, 'iMsg2': iMsg2, 'imsgt': imsgt, 'munNum': munNum}

    def aboutWork(self):
        menuList = ['--关于工作', '--工作经历', '--项目经历', '--工作技能']
        iMsg = '关于工作'
        iMsg2 = '⏬⏬⏬点击下载简历⏬⏬⏬'
        imsgt = '2021-02-18'
        heightList = [0, 29, 1000, 2800, 9999999]
        munNum = [1, 2, 3]

        return {'menuList': menuList, 'heightList': heightList, 'iMsg': iMsg, 'iMsg2': iMsg2, 'imsgt': imsgt, 'munNum': munNum}

    def aboutSkill(self):
        menuList = ['--关于技能', '--游戏', '--运动', '--做菜', '--魔术', '--工作']
        iMsg = '关于技能'
        iMsg2 = '你可以通过这里更加的了解我喜欢什么，或者都说会些什么'
        imsgt = '2021-01-07'
        heightList = [0, 58, 301, 453, 604, 765, 9999999]
        munNum = [1, 2, 3, 4, 5]

        return {'menuList': menuList, 'heightList': heightList, 'iMsg': iMsg, 'iMsg2': iMsg2, 'imsgt': imsgt, 'munNum': munNum}

    def getInfo(self, pid):
        if pid == 0:
            return self.aboutMe()
        elif pid == 1:
            return self.aboutPage()
        elif pid == 2:
            return self.aboutWork()
        elif pid == 3:
            return self.aboutSkill()
        else:
            return {
                'code': -2,
                'msg': 'errId,getListErr'
            }

    def getParagraph(self, pid):
        if pid == 0:
            return About.me
        elif pid == 1:
            return About.page
        elif pid == 2:
            return About.work
        elif pid == 3:
            return About.skill
        else:
            return {
                'code': -4,
                'msg': 'errId,getParagraphErr'
            }


if __name__ == '__main__':
    a = About()
    pid = 1
    rsp = {
        'paragraph': a.getParagraph(pid),
        'list': a.getInfo(pid)
    }
    print(rsp)
    print(rsp['list'])
    print(rsp['paragraph'])
